<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'Полето мора да се прифати.',
    'active_url' => 'Внесената вредност во полето не е валидно URL.',
    'after' => 'Вредноста во полето мора да биде датум по :date.',
    'after_or_equal' => 'Вредноста во полето мора да е датум по или еднаков на :date.',
    'alpha' => 'Вредноста во полето мора да содржи само букви.',
    'alpha_dash' => 'Вредноста во полето мора да содржи само букви, бројки, црти и долни-црти.',
    'alpha_num' => 'Вредноста во полето мора да содржи само букви и бројки.',
    'array' => 'Вредноста во полето мора да биде низа.',
    'before' => 'Вредноста во полето мора да биде датум пред :date.',
    'before_or_equal' => 'Вредноста во полето мора да биде датум пред или еднаков на :date.',
    'between' => [
        'numeric' => 'Вредноста во полето мора да биде помеѓу :min и :max.',
        'file' => 'Вредноста во полето мора да биде помеѓу :min и :max килобајти.',
        'string' => 'Вредноста во полето мора да биде помеѓу :min и :max карактери.',
        'array' => 'Вредноста во полето мора да биде помеѓу :min и :max ставки.',
    ],
    'boolean' => 'Полето мора да биде точно или неточно.',
    'confirmed' => 'Потврдата не се совпаѓа.',
    'current_password' => 'Лозинката е неточна.',
    'date' => 'Вредноста не е валиден датум.',
    'date_equals' => 'Вредноста мора да биде датум еднаков на :date.',
    'date_format' => 'Вредноста не е во дадениот формат :format.',
    'different' => 'Вредноста мора да биде различна од :other.',
    'digits' => 'Вредонста мора да биде :digits цифри.',
    'digits_between' => 'Вредонста мора да биде помеѓу :min и :max цифри.',
    'dimensions' => 'Вредноста има не валидни димензии за слика.',
    'distinct' => 'Полето има дупликат вредност.',
    'email' => 'Полето мора да е валидна емаил адреса.',
    'ends_with' => 'Полето мора да завршува со едно од следниве: :values.',
    'exists' => 'Селектираното поле е не валидно.',
    'file' => 'Мора да е датотека',
    'filled' => 'Полето мора да има вредност.',
    'gt' => [
        'numeric' => 'Вредноста мора да биде поголема од :value.',
        'file' => 'Вредноста мора да биде поголема од :value килобајти.',
        'string' => 'Вредноста мора да биде поголема од :value карактери.',
        'array' => 'Вредноста мора да биде поголема од :value ставки.',
    ],
    'gte' => [
        'numeric' => 'Вредноста мора да биде поголема или еднаква од :value.',
        'file' => 'Вредноста мора да биде поголема или еднаква од :value килобајти.',
        'string' => 'Вредноста мора да биде поголема или еднаква од :value карактери.',
        'array' => 'Вредонста мора да има :value или повеќе ставки.',
    ],
    'image' => 'Вредноста мора да биде слика.',
    'in' => 'Селектираната вредност е не валидна.',
    'in_array' => 'Полето не постои во :other.',
    'integer' => 'Вредноста мора да биде цел број',
    'ip' => 'Вредноста мора да биде валидна IP адреса',
    'ipv4' => 'Вредноста мора да биде валидна IPv4 адреса.',
    'ipv6' => 'Вредноста мора да биде валидна IPv6 адреса.',
    'json' => 'Вредноста мора да биде валиден JSON стринг',
    'lt' => [
        'numeric' => 'Вредноста мора да биде помала од :value.',
        'file' => 'Вредноста мора да биде помала од :value килобати.',
        'string' => 'Вредноста мора да биде помала од :value карактери.',
        'array' => 'Вредноста мора да биде помала од :value ставки.',
    ],
    'lte' => [
        'numeric' => 'Вредноста мора да биде помала или еднаква од :value.',
        'file' => 'Вредноста мора да биде помала или еднаква од :value килобајти.',
        'string' => 'Вредноста мора да биде помала или еднаква од :value карактери.',
        'array' => 'Вредноста мора да нема повеќе од :value ставки.',
    ],
    'max' => [
        'numeric' => 'Вредноста не треба да биде поголема од :max.',
        'file' => 'Вредноста не треба да биде поголема од :max килобајти.',
        'string' => 'Вредноста не треба да биде поголема од :max карактери.',
        'array' => 'Вредноста мора да нема повеќе од :max ставки.',
    ],
    'mimes' => 'Вредноста мора да биде датотека од тип: :values.',
    'mimetypes' => 'Вредноста мора да биде датотека од тип: :values.',
    'min' => [
        'numeric' => 'Вредноста мора да биде барем :min.',
        'file' => 'Вредноста мора да биде барем :min килобајти.',
        'string' => 'Вредноста мора да биде барем :min карактери.',
        'array' => 'Мора да има најмалку :min ставки.',
    ],
    'multiple_of' => 'Мора да биде повеќе од :value.',
    'not_in' => 'Селектираното поле е не валидно.',
    'not_regex' => 'Форматот не е валиден.',
    'numeric' => 'Мора да биде број.',
    'password' => 'Лозинката е погрешна.',
    'present' => 'Полето мора да биде присутно.',
    'regex' => 'Форматот не е валиден',
    'required' => 'Полето е задолжително',
    'required_if' => 'Полето е задолжително кога :other е :value.',
    'required_unless' => 'Полето е задолжително освен ако :other е во :values.',
    'required_with' => 'Полето е задолжително кога :values е пополнето.',
    'required_with_all' => 'Полето е задолжително кога :values се пополнето.',
    'required_without' => 'Полето е задолжително кога :values не е пополнето.',
    'required_without_all' => 'Полето е задолжително кога ни едно од :values не е пополнето.',
    'prohibited' => 'Полето е забрането.',
    'prohibited_if' => 'Полето е забрането кога :other е :value.',
    'prohibited_unless' => 'Полето е забрането освен ако :other е во :values.',
    'same' => 'Едното и другото мора да бидат исти.',
    'size' => [
        'numeric' => 'Мора да биде :size.',
        'file' => 'Мора да биде :size килобајти.',
        'string' => 'Мора да биде :size карактери.',
        'array' => 'Мора да содржи :size ставнки.',
    ],
    'starts_with' => 'Мора да започне со едно од следниве: :values.',
    'string' => 'Мора да биде стринг.',
    'timezone' => 'Мора да биде валидна временска зона.',
    'unique' => 'Зафатено.',
    'uploaded' => 'Датотеката не успеа да се прикачи.',
    'url' => 'Мора да биде валидно URL',
    'uuid' => 'Мора да биде валидно UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
