<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Macedonian Invoice Language Lines
    |--------------------------------------------------------------------------
    */

    'invoice'                => 'Фактура',
    'serial'                 => 'Сериски Бр.',
    'date'                   => 'Дата на Издавање',
    'seller'                 => 'Продавач',
    'buyer'                  => 'Купувач',
    'address'                => 'Адреса',
    'code'                   => 'Код',
    'vat'                    => 'ВАТ код',
    'phone'                  => 'Телефон',
    'description'            => 'Опис',
    'units'                  => 'Единици',
    'quantity'               => 'Количина',
    'price'                  => 'Цена',
    'discount'               => 'Попуст',
    'tax'                    => 'Данок',
    'sub_total'              => 'Под вкупно',
    'total_discount'         => 'Вкупен попуст',
    'taxable_amount'         => 'Износ на оданочување',
    'total_taxes'            => 'Вкупни даноци',
    'tax_rate'               => 'Даночна стапка',
    'total_amount'           => 'Вкупен износ',
    'pay_until'              => 'Ве молиме платејте до',
    'amount_in_words'        => 'Износ со зборови',
    'amount_in_words_format' => '%s %s',
    'notes'                  => 'Белешки',
    'shipping'               => 'Испорака',
    'paid'                   => 'Платено',
    'due'                    => 'До',
    'page'                   => 'Страна',
];
